In [1]:
#add depedencies
import pandas as pd

## Cleaning Budget Data

In [2]:
#Load finance file
data_df=pd.read_csv("../School Budget Data '12-'13.zip",
                       names=['County_Code','District_Code','School_Code','Fiscal_Year',
                                  'Period','Colcode','Account_Code','Fund_Code','Resource_Code',
                                  'Project_Year','Goal','Function_Code','Object_Code','Amount'])
data_df

C:\Users\hhngu\AppData\Roaming\Python\Python37\site-packages\IPython\core\interactiveshell.py:3051: DtypeWarning: Columns (9) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,County_Code,District_Code,School_Code,Fiscal_Year,Period,Colcode,Account_Code,Fund_Code,Resource_Code,Project_Year,Goal,Function_Code,Object_Code,Amount
0,1,10017,0,2012,A,BA,0100000000000008011,1,0,0,0000,0,8011,1405033.00
1,1,10017,0,2012,A,BA,0100000000000008019,1,0,0,0000,0,8019,13433.00
2,1,10017,0,2012,A,BA,0100000000000008021,1,0,0,0000,0,8021,119704.31
3,1,10017,0,2012,A,BA,0100000000000008022,1,0,0,0000,0,8022,5.34
4,1,10017,0,2012,A,BA,0100000000000008029,1,0,0,0000,0,8029,1084.38
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1282057,58,72769,0,2012,A,BA,7300000000000009500,73,0,0,0000,0,9500,1518.48
1282058,58,72769,0,2012,A,BA,7300000000000009790,73,0,0,0000,0,9790,71592.16
1282059,58,72769,0,2012,A,BA,7300000000000009791,73,0,0,0000,0,9791,73088.90
1282060,58,72769,0,2012,A,BA,730000000000000979Z,73,0,0,0000,0,979Z,71592.16
1282061,58,72769,0,2012,A,BA,7300000000027005800,73,0,0,0000,2700,5800,8822.24

In [3]:
#Determine any missing values 
data_df.dropna()
data_df.count()

County_Code      1282062
District_Code    1282062
School_Code      1282062
Fiscal_Year      1282062
Period           1282062
Colcode          1282062
Account_Code     1282062
Fund_Code        1282062
Resource_Code    1282062
Project_Year     1282062
Goal             1282062
Function_Code    1282062
Object_Code      1282062
Amount           1282062
dtype: int64

In [4]:
data_df.dtypes

County_Code        int64
District_Code      int64
School_Code        int64
Fiscal_Year        int64
Period            object
Colcode           object
Account_Code      object
Fund_Code          int64
Resource_Code      int64
Project_Year      object
Goal              object
Function_Code      int64
Object_Code       object
Amount           float64
dtype: object

In [5]:
#Select desired columns
clean_data_df=data_df[['County_Code','District_Code','School_Code','Function_Code','Amount']]
clean_data_df

         County_Code  District_Code  School_Code  Function_Code      Amount
0                  1          10017            0              0  1405033.00
1                  1          10017            0              0    13433.00
2                  1          10017            0              0   119704.31
3                  1          10017            0              0        5.34
4                  1          10017            0              0     1084.38
...              ...            ...          ...            ...         ...
1282057           58          72769            0              0     1518.48
1282058           58          72769            0              0    71592.16
1282059           58          72769            0              0    73088.90
1282060           58          72769            0              0    71592.16
1282061           58          72769            0           2700     8822.24

[1282062 rows x 5 columns]

In [6]:
#Concatenate district, county and school code to get CDS CODE
clean_data_df['District']=clean_data_df['District_Code'] * 10000000
clean_data_df['County']=clean_data_df['County_Code'] * 1000000000000
clean_data_df

C:\Users\hhngu\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\hhngu\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,County_Code,District_Code,School_Code,Function_Code,Amount,District,County
0,1,10017,0,0,1405033.00,100170000000,1000000000000
1,1,10017,0,0,13433.00,100170000000,1000000000000
2,1,10017,0,0,119704.31,100170000000,1000000000000
3,1,10017,0,0,5.34,100170000000,1000000000000
4,1,10017,0,0,1084.38,100170000000,1000000000000
...,...,...,...,...,...,...,...
1282057,58,72769,0,0,1518.48,727690000000,58000000000000
1282058,58,72769,0,0,71592.16,727690000000,58000000000000
1282059,58,72769,0,0,73088.90,727690000000,58000000000000
1282060,58,72769,0,0,71592.16,727690000000,58000000000000
1282061,58,72769,0,2700,8822.24,727690000000,58000000000000

In [7]:
clean_data_df['CDS_CODE']=clean_data_df['District'] + clean_data_df['County'] + clean_data_df['School_Code']
clean_data_df

C:\Users\hhngu\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,County_Code,District_Code,School_Code,Function_Code,Amount,District,County,CDS_CODE
0,1,10017,0,0,1405033.00,100170000000,1000000000000,1100170000000
1,1,10017,0,0,13433.00,100170000000,1000000000000,1100170000000
2,1,10017,0,0,119704.31,100170000000,1000000000000,1100170000000
3,1,10017,0,0,5.34,100170000000,1000000000000,1100170000000
4,1,10017,0,0,1084.38,100170000000,1000000000000,1100170000000
...,...,...,...,...,...,...,...,...
1282057,58,72769,0,0,1518.48,727690000000,58000000000000,58727690000000
1282058,58,72769,0,0,71592.16,727690000000,58000000000000,58727690000000
1282059,58,72769,0,0,73088.90,727690000000,58000000000000,58727690000000
1282060,58,72769,0,0,71592.16,727690000000,58000000000000,58727690000000
1282061,58,72769,0,2700,8822.24,727690000000,58000000000000,58727690000000

In [8]:
clean_data=clean_data_df[['CDS_CODE','District_Code','Function_Code','Amount']]
clean_data

               CDS_CODE  District_Code  Function_Code      Amount
0         1100170000000          10017              0  1405033.00
1         1100170000000          10017              0    13433.00
2         1100170000000          10017              0   119704.31
3         1100170000000          10017              0        5.34
4         1100170000000          10017              0     1084.38
...                 ...            ...            ...         ...
1282057  58727690000000          72769              0     1518.48
1282058  58727690000000          72769              0    71592.16
1282059  58727690000000          72769              0    73088.90
1282060  58727690000000          72769              0    71592.16
1282061  58727690000000          72769           2700     8822.24

[1282062 rows x 4 columns]

In [9]:
clean_data = clean_data[clean_data.Function_Code != 0]
clean_data

               CDS_CODE  District_Code  Function_Code     Amount
29        1100170000000          10017           2100  -43306.31
30        1100170000000          10017           2100    5148.00
31        1100170000000          10017           2100   43306.31
32        1100170000000          10017           2110  -44716.00
33        1100170000000          10017           3140   13836.60
...                 ...            ...            ...        ...
1282029  58727690000000          72769           8500   29789.00
1282038  58727690000000          72769           7200     341.06
1282051  58727690000000          72769           8500  199261.55
1282052  58727690000000          72769           9100   72778.65
1282061  58727690000000          72769           2700    8822.24

[1000742 rows x 4 columns]

In [10]:
clean_data = clean_data[clean_data.Amount >= 0]
clean_data

               CDS_CODE  District_Code  Function_Code     Amount
30        1100170000000          10017           2100    5148.00
31        1100170000000          10017           2100   43306.31
33        1100170000000          10017           3140   13836.60
34        1100170000000          10017           3140    5856.82
35        1100170000000          10017           3140    1103.77
...                 ...            ...            ...        ...
1282029  58727690000000          72769           8500   29789.00
1282038  58727690000000          72769           7200     341.06
1282051  58727690000000          72769           8500  199261.55
1282052  58727690000000          72769           9100   72778.65
1282061  58727690000000          72769           2700    8822.24

[977361 rows x 4 columns]

## Cleaning Objects.CSV

In [ ]:
#load object budget categories
#object_df=pd.read_csv("../Objects (Budget Categories).csv",
                   #  names=['Code','Title'])
#object_df

In [ ]:
#Drop na and count to verify
#object_df.dropna()
#object_df.count()

In [ ]:
#Delete extra columns
#object_df=object_df[['Code','Title']]
#object_df

In [ ]:
#Verify datatypes
#object_df.dtypes

In [ ]:
#Clarify what is null, if any
#object_df1=object_df[object_df.isna().any(axis=1)]
#object_df1

In [ ]:
#Drop Null
#object_df=object_df.dropna()
#object_df

In [ ]:
#Rename column
#object_df=object_df.rename(columns={"Code":"Object_Code","Title":"Object"})
#object_df

In [ ]:
#Merge object table with budget table
#clean_data=pd.merge(clean_data, object_df, on =['Object_Code'])
#clean_data

In [ ]:
#Drop unnecessary columns
#clean_data=clean_data[['CDS_CODE','Object','Function_Code','Amount']]
#clean_data

## Cleaning Function.CSV

In [11]:
#load object budget categories
function_df=pd.read_csv("../Objects (Budget Categories).csv",
                     names=['Function_Code','Function'])
#object_df
#load function csv
#function_df=pd.read_csv("../Function (Budget Categories).csv")
function_df

    Function_Code                                           Function
0            1100  Certificated Teachers' Salaries               ...
1            1200  Certificated Pupil Support Salaries           ...
2            1300  Certificated Supervisors' and Administrators' ...
3            1900  Other Certificated Salaries                   ...
4            2100  Classified Instructional Salaries             ...
..            ...                                                ...
233          9793  Audit Adjustments                             ...
234          9795  Other Restatements                            ...
235          9796  Net Investment in Capital Assets              ...
236          9797  Restricted Net Position                       ...
237          979Z  EFB (Calculated)                              ...

[238 rows x 2 columns]

In [12]:
#keep necessary columns
function_df=function_df[['Function_Code','Function']]
function_df

    Function_Code                                           Function
0            1100  Certificated Teachers' Salaries               ...
1            1200  Certificated Pupil Support Salaries           ...
2            1300  Certificated Supervisors' and Administrators' ...
3            1900  Other Certificated Salaries                   ...
4            2100  Classified Instructional Salaries             ...
..            ...                                                ...
233          9793  Audit Adjustments                             ...
234          9795  Other Restatements                            ...
235          9796  Net Investment in Capital Assets              ...
236          9797  Restricted Net Position                       ...
237          979Z  EFB (Calculated)                              ...

[238 rows x 2 columns]

In [13]:
function_df=function_df.drop(function_df.index[237])
function_df

    Function_Code                                           Function
0            1100  Certificated Teachers' Salaries               ...
1            1200  Certificated Pupil Support Salaries           ...
2            1300  Certificated Supervisors' and Administrators' ...
3            1900  Other Certificated Salaries                   ...
4            2100  Classified Instructional Salaries             ...
..            ...                                                ...
232          9791  Beginning Fund Balance                        ...
233          9793  Audit Adjustments                             ...
234          9795  Other Restatements                            ...
235          9796  Net Investment in Capital Assets              ...
236          9797  Restricted Net Position                       ...

[237 rows x 2 columns]

In [14]:
#determine which are null
function_df1=function_df[function_df.isna().any(axis=1)]
function_df1

Empty DataFrame
Columns: [Function_Code, Function]
Index: []

In [15]:
#drop NA
function_df_clean=function_df.dropna()
function_df_clean

    Function_Code                                           Function
0            1100  Certificated Teachers' Salaries               ...
1            1200  Certificated Pupil Support Salaries           ...
2            1300  Certificated Supervisors' and Administrators' ...
3            1900  Other Certificated Salaries                   ...
4            2100  Classified Instructional Salaries             ...
..            ...                                                ...
232          9791  Beginning Fund Balance                        ...
233          9793  Audit Adjustments                             ...
234          9795  Other Restatements                            ...
235          9796  Net Investment in Capital Assets              ...
236          9797  Restricted Net Position                       ...

[237 rows x 2 columns]

In [16]:
#rough estimate
function_df_clean.count()

Function_Code    237
Function         237
dtype: int64

In [17]:
#verify datatypes
clean_data.dtypes

CDS_CODE           int64
District_Code      int64
Function_Code      int64
Amount           float64
dtype: object

In [18]:
#change datatypes to match in order to merge
clean_data['Function_Code'] = clean_data['Function_Code'].astype('int64')
function_df_clean['Function_Code']= function_df_clean['Function_Code'].astype('int64')

C:\Users\hhngu\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [19]:
#merge
func_df=pd.merge(clean_data, function_df_clean, on=['Function_Code'])
func_df

,CDS_CODE,District_Code,Function_Code,Amount,Function
0,1100170000000,10017,2100,5148.00,Classified Instructional Salaries ...
1,1100170000000,10017,2100,43306.31,Classified Instructional Salaries ...
2,1100170000000,10017,2100,33486.20,Classified Instructional Salaries ...
3,1100170000000,10017,2100,172578.82,Classified Instructional Salaries ...
4,1100170000000,10017,2100,165525.64,Classified Instructional Salaries ...
...,...,...,...,...,...
123974,57105790000000,10579,7350,107.15,Transfers of Indirect Costs - Interfund ...
123975,57105790000000,10579,7350,795.80,Transfers of Indirect Costs - Interfund ...
123976,57105790000000,10579,7350,19.72,Transfers of Indirect Costs - Interfund ...
123977,57105790000000,10579,7350,700.00,Transfers of Indirect Costs - Interfund ...
123978,57105790000000,10579,7350,45.88,Transfers of Indirect Costs - Interfund ...

In [20]:
#Keep necessary columns
final_data=func_df[['CDS_CODE','District_Code','Function_Code','Function','Amount']]
final_data

,CDS_CODE,District_Code,Function_Code,Function,Amount
0,1100170000000,10017,2100,Classified Instructional Salaries ...,5148.00
1,1100170000000,10017,2100,Classified Instructional Salaries ...,43306.31
2,1100170000000,10017,2100,Classified Instructional Salaries ...,33486.20
3,1100170000000,10017,2100,Classified Instructional Salaries ...,172578.82
4,1100170000000,10017,2100,Classified Instructional Salaries ...,165525.64
...,...,...,...,...,...
123974,57105790000000,10579,7350,Transfers of Indirect Costs - Interfund ...,107.15
123975,57105790000000,10579,7350,Transfers of Indirect Costs - Interfund ...,795.80
123976,57105790000000,10579,7350,Transfers of Indirect Costs - Interfund ...,19.72
123977,57105790000000,10579,7350,Transfers of Indirect Costs - Interfund ...,700.00
123978,57105790000000,10579,7350,Transfers of Indirect Costs - Interfund ...,45.88

In [21]:
#Organize data
final_data=final_data.groupby(['CDS_CODE','District_Code','Function_Code','Function']).sum()
final_data

                                                                                                   Amount
CDS_CODE       District_Code Function_Code Function
1100170000000  10017         2100          Classified Instructional Salaries              ...  5761988.84
                             5900          Communications                                 ...  2126900.99
                             7110          Tuition for Instruction Under Interdistrict Att...   248316.29
                             8110          Maintenance and Operations (Public Law 81-874) ...     2607.78
                             9200          Accounts Receivable                            ...  1138122.98
...                                                                                                   ...
58727510000000 72751         9200          Accounts Receivable                            ...   257897.98
58727690000000 72769         2100          Classified Instructional Salaries              ...    81262.45
                             4200          Books and Other Reference Materials            ...   145863.48
                             8110          Maintenance and Operations (Public Law 81-874) ...   227745.90
                             9200          Accounts Receivable                            ...    64649.82

[3998 rows x 1 columns]

In [22]:
final_data.to_csv('../Finance_Data/Finance_1213.csv')